# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # Needed to install fonts

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'php'
brew 'php@8.2'
brew 'php@8.1'
brew 'php@8.0'
brew 'composer'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'docker'
brew 'nvm'
brew 'mailhog'

# Apps
cask 'alfred'
cask '1password'
cask 'caffeine'
cask 'dbngin'
cask 'fig'
cask 'figma'
cask 'firefox'
cask 'front'
cask 'google-chrome'
cask 'iterm2'
cask 'imageoptim'
# Productive (not supported yet)
cask 'phpmon'
cask 'phpstorm'
cask 'ray'
cask 'raycast'
cask 'slack'
cask 'tableplus'
cask 'tower'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'tuple'
cask 'visual-studio-code'
cask 'whatsapp'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
